In [1]:
# 175. Combine Two Tables LEETCODE
# SELECT firstName, lastName, city, state
# FROM Person p
# LEFT JOIN Address a ON p.personId = a.personId

In [2]:
# 577. Employee Bonus
# Easy
# Topics
# Companies
# Hint
# SQL Schema
# Pandas Schema
# Table: Employee

# +-------------+---------+
# | Column Name | Type    |
# +-------------+---------+
# | empId       | int     |
# | name        | varchar |
# | supervisor  | int     |
# | salary      | int     |
# +-------------+---------+
# empId is the column with unique values for this table.
# Each row of this table indicates the name and the ID of an employee in addition to their salary and the id of their manager.
 

# Table: Bonus

# +-------------+------+
# | Column Name | Type |
# +-------------+------+
# | empId       | int  |
# | bonus       | int  |
# +-------------+------+
# empId is the column of unique values for this table.
# empId is a foreign key (reference column) to empId from the Employee table.
# Each row of this table contains the id of an employee and their respective bonus.
 

# Write a solution to report the name and bonus amount of each employee with a bonus less than 1000.

# Return the result table in any order.

# The result format is in the following example.

In [3]:
# SELECT e.name, b.bonus
# FROM Employee e
# LEFT JOIN Bonus b ON e.empId = b.empId
# WHERE b.bonus < 1000 OR b.bonus IS NULL;

In [ ]:
# 181. Employees Earning More Than Their Managers
# Easy
# Topics
# Companies
# SQL Schema
# Pandas Schema
# Table: Employee

# +-------------+---------+
# | Column Name | Type    |
# +-------------+---------+
# | id          | int     |
# | name        | varchar |
# | salary      | int     |
# | managerId   | int     |
# +-------------+---------+
# id is the primary key (column with unique values) for this table.
# Each row of this table indicates the ID of an employee, their name, salary, and the ID of their manager.
 

# Write a solution to find the employees who earn more than their managers.

# Return the result table in any order.

# The result format is in the following example.

 

# Example 1:

# Input: 
# Employee table:
# +----+-------+--------+-----------+
# | id | name  | salary | managerId |
# +----+-------+--------+-----------+
# | 1  | Joe   | 70000  | 3         |
# | 2  | Henry | 80000  | 4         |
# | 3  | Sam   | 60000  | Null      |
# | 4  | Max   | 90000  | Null      |
# +----+-------+--------+-----------+
# Output: 
# +----------+
# | Employee |
# +----------+
# | Joe      |
# +----------+
# Explanation: Joe is the only employee who earns more than his manager.

In [ ]:
# SELECT e.name AS Employee
# FROM Employee e
# JOIN Employee m ON e.managerId = m.id
# WHERE e.salary > m.salary

In [ ]:
# 182. Duplicate Emails
# Easy
# Topics
# Companies
# SQL Schema
# Pandas Schema
# Table: Person

# +-------------+---------+
# | Column Name | Type    |
# +-------------+---------+
# | id          | int     |
# | email       | varchar |
# +-------------+---------+
# id is the primary key (column with unique values) for this table.
# Each row of this table contains an email. The emails will not contain uppercase letters.
 

# Write a solution to report all the duplicate emails. Note that it's guaranteed that the email field is not NULL.

# Return the result table in any order.

# The result format is in the following example.

 

# Example 1:

# Input: 
# Person table:
# +----+---------+
# | id | email   |
# +----+---------+
# | 1  | a@b.com |
# | 2  | c@d.com |
# | 3  | a@b.com |
# +----+---------+
# Output: 
# +---------+
# | Email   |
# +---------+
# | a@b.com |
# +---------+
# Explanation: a@b.com is repeated two times.

In [6]:
# SELECT email AS Email
# FROM Person
# GROUP BY email
# HAVING COUNT(*) > 1

In [5]:
# 183. Customers Who Never Order
# Easy
# Topics
# Companies
# SQL Schema
# Pandas Schema
# Table: Customers

# +-------------+---------+
# | Column Name | Type    |
# +-------------+---------+
# | id          | int     |
# | name        | varchar |
# +-------------+---------+
# id is the primary key (column with unique values) for this table.
# Each row of this table indicates the ID and name of a customer.
 

# Table: Orders

# +-------------+------+
# | Column Name | Type |
# +-------------+------+
# | id          | int  |
# | customerId  | int  |
# +-------------+------+
# id is the primary key (column with unique values) for this table.
# customerId is a foreign key (reference columns) of the ID from the Customers table.
# Each row of this table indicates the ID of an order and the ID of the customer who ordered it.
 

# Write a solution to find all customers who never order anything.

# Return the result table in any order.

# The result format is in the following example.

 

# Example 1:

# Input: 
# Customers table:
# +----+-------+
# | id | name  |
# +----+-------+
# | 1  | Joe   |
# | 2  | Henry |
# | 3  | Sam   |
# | 4  | Max   |
# +----+-------+
# Orders table:
# +----+------------+
# | id | customerId |
# +----+------------+
# | 1  | 3          |
# | 2  | 1          |
# +----+------------+
# Output: 
# +-----------+
# | Customers |
# +-----------+
# | Henry     |
# | Max       |
# +-----------+

In [4]:
# SELECT name AS Customers
# FROM Customers c
# LEFT JOIN Orders o
# ON c.id = o.customerId
# WHERE o.id IS NULL;

# LEFT JOIN REQUIRED BECAUSE WE NEED TO RETURN ALL FIRT THE  FILETER WITH WHERE CLAUSE

In [7]:
# 196. Delete Duplicate Emails
# Solved
# Easy
# Topics
# Companies
# SQL Schema
# Pandas Schema
# Table: Person

# +-------------+---------+
# | Column Name | Type    |
# +-------------+---------+
# | id          | int     |
# | email       | varchar |
# +-------------+---------+
# id is the primary key (column with unique values) for this table.
# Each row of this table contains an email. The emails will not contain uppercase letters.
 

# Write a solution to delete all duplicate emails, keeping only one unique email with the smallest id.

# For SQL users, please note that you are supposed to write a DELETE statement and not a SELECT one.

# For Pandas users, please note that you are supposed to modify Person in place.

# After running your script, the answer shown is the Person table. The driver will first compile and run your piece of code and then show the Person table. The final order of the Person table does not matter.

# The result format is in the following example.

 

# Example 1:

# Input: 
# Person table:
# +----+------------------+
# | id | email            |
# +----+------------------+
# | 1  | john@example.com |
# | 2  | bob@example.com  |
# | 3  | john@example.com |
# +----+------------------+
# Output: 
# +----+------------------+
# | id | email            |
# +----+------------------+
# | 1  | john@example.com |
# | 2  | bob@example.com  |
# +----+------------------+
# Explanation: john@example.com is repeated two times. We keep the row with the smallest Id = 1.

In [8]:
# DELETE p1
# FROM Person p1
# JOIN  Person p2
# ON p1.email = p2.email AND p1.id > p2.id

In [ ]:
# 197. Rising Temperature
# Solved
# Easy
# Topics
# Companies
# SQL Schema
# Pandas Schema
# Table: Weather

# +---------------+---------+
# | Column Name   | Type    |
# +---------------+---------+
# | id            | int     |
# | recordDate    | date    |
# | temperature   | int     |
# +---------------+---------+
# id is the column with unique values for this table.
# There are no different rows with the same recordDate.
# This table contains information about the temperature on a certain day.
 

# Write a solution to find all dates' id with higher temperatures compared to its previous dates (yesterday).

# Return the result table in any order.

# The result format is in the following example.

 

# Example 1:

# Input: 
# Weather table:
# +----+------------+-------------+
# | id | recordDate | temperature |
# +----+------------+-------------+
# | 1  | 2015-01-01 | 10          |
# | 2  | 2015-01-02 | 25          |
# | 3  | 2015-01-03 | 20          |
# | 4  | 2015-01-04 | 30          |
# +----+------------+-------------+
# Output: 
# +----+
# | id |
# +----+
# | 2  |
# | 4  |
# +----+
# Explanation: 
# In 2015-01-02, the temperature was higher than the previous day (10 -> 25).
# In 2015-01-04, the temperature was higher than the previous day (20 -> 30).

In [ ]:
# import pandas as pd

# def rising_temperature(weather: pd.DataFrame) -> pd.DataFrame:
#     weather = weather.sort_values('recordDate').reset_index()
#     mask = weather["temperature"] > weather["temperature"].shift(1)
#     mask2 = (weather["recordDate"] - weather["recordDate"].shift(1)).dt.days == 1
#     result = weather[mask & mask2]
#     return result[['id']]